test/request-response-samples/Dummy__should_handle_array_namespace_in_request/request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:n="http://www.Dummy.com/Name/Types"><soap:Body><n:DummyRequest xmlns:n="http://www.Dummy.com/Name/Types" xmlns="http://www.Dummy.com/Name/Types"><n:Customers><n:Customer><n:DOB>01/01/1990</n:DOB><n:FirstName>Tim</n:FirstName><n:LastName>Pope</n:LastName></n:Customer></n:Customers><n:Email>test@example.com</n:Email></n:DummyRequest></soap:Body></soap:Envelope>